{
  "backend/main.mo": "Main backend actor implementing user profile management with owner privileges for 'CelestiNix', subscription tiers (monthly/annual), Twitch account management with revenue tracking, subscription plan CRUD operations, Stripe integration for payments, and access control with admin permissions.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: a Stripe Connect button visible only to the owner (CelestiNix) in the header, and a light blue menu background color update throughout the interface.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, React Query hooks, layout with light blue menu background and Stripe Connect button, authentication pages, Twitch account management, revenue tracking, subscription components, and styling configuration.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes, including background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors with sidebar theming.",
  "frontend/index.html": "HTML entry point for the 'Stream Automation Hub' application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application with TanStack Router configuration defining routes for login, Twitch accounts, revenue details, subscription management, admin dashboard, AI assistant, chat room, Discord tools, finance tracker, calculator, and donation manager with authentication guards and profile setup flow.",
  "frontend/src/components/AIAssistant.tsx": "AI assistant chat interface component with message history, simulated responses for game/web/app development queries, and typing indicators using shadcn/ui components.",
  "frontend/src/components/Calculator.tsx": "A React calculator component with basic arithmetic operations (+, -, *, /), decimal support, clear, backspace, and a display showing current value and previous operation. Uses shadcn/ui Card and Button components with state management for calculation logic.",
  "frontend/src/components/ChatRoom.tsx": "An Inuyasha-themed chat room component with message display, user avatars, active users list, and message input. Features a background image with backdrop blur and uses useGetCallerUserProfile hook to identify the current user.",
  "frontend/src/components/DiscordServerBuilder.tsx": "A Discord server planning tool with tabs for managing channels, roles, and setup guide. Allows adding/removing channels and roles with customizable names and colors, using Discord branding colors and icons.",
  "frontend/src/components/DonationManager.tsx": "A donation management dashboard with wallet connections (PayPal, Crypto) and donation history tracking. Displays total donations received and provides dialogs for adding/removing payment wallets with labels and addresses.",
  "frontend/src/components/FinanceTracker.tsx": "A personal finance tracker with income/expense transaction management. Shows summary cards for total income, expenses, and net balance, with tabs for adding transactions and viewing transaction history with delete functionality.",
  "frontend/src/components/Layout.tsx": "Main application layout component with navigation header, authentication controls, theme provider, and routing for dashboard, Twitch accounts, revenue, subscriptions, and admin sections. Includes Stripe Connect integration and subscription status checks.",
  "frontend/src/components/ProfileCard.tsx": "Displays user profile information including name, subscription status, subscription tier, and an admin dashboard button for owners. Shows loading skeletons while data is being fetched.",
  "frontend/src/components/ProfileSetup.tsx": "Initial profile setup form that prompts new users to enter their name and creates a user profile with inactive subscription status.",
  "frontend/src/components/RevenueChart.tsx": "Displays revenue entries in a sortable table with date, description, and amount columns, plus a total revenue summary. Shows empty state when no entries exist.",
  "frontend/src/components/RevenueEntryForm.tsx": "Form for adding new revenue entries with Twitch account selection, amount input, and description fields. Validates inputs and requires an associated Twitch account.",
  "frontend/src/components/SubscriptionGuard.tsx": "Route guard component that blocks access to features for users without active subscriptions, displaying a subscription required message with a call-to-action to view plans.",
  "frontend/src/components/SubscriptionStatusCard.tsx": "Card component displaying current subscription status (active, cancelled, or inactive) with plan details, dates, and action buttons to manage or purchase subscriptions.",
  "frontend/src/components/TaskCard.tsx": "Empty file with no content.",
  "frontend/src/components/TaskForm.tsx": "Empty file with no content.",
  "frontend/src/components/TaskList.tsx": "Empty file with no content.",
  "frontend/src/components/TaskStatusIndicator.tsx": "Empty file with no content.",
  "frontend/src/components/TwitchAccountCard.tsx": "Displays a Twitch account card with revenue totals, account type (affiliate/partner), status badge, and action buttons for viewing revenue details or upgrading account type based on user permissions.",
  "frontend/src/components/TwitchAccountForm.tsx": "Form component for creating a new Twitch account with username input and radio group selection for account type (affiliate or partner).",
  "frontend/src/components/TwitchAccountList.tsx": "Renders a grid of TwitchAccountCard components or displays loading skeletons and an empty state when no accounts exist.",
  "frontend/src/components/TwitchSubscribeWidget.tsx": "Button widget that opens a Twitch channel (auroramoonveil) in a new window for subscribing.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient integration and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of React Query hooks for user profiles, Twitch accounts, revenue entries, subscription management, and Stripe integration with the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, including primary, secondary, accent, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page for managing subscription plans, restricted to app owners. Provides UI for creating, editing, deleting, and toggling subscription plan status with form dialogs.",
  "frontend/src/pages/AIAssistantPage.tsx": "Page component that wraps the AIAssistant component with a SubscriptionGuard to restrict access to subscribed users.",
  "frontend/src/pages/CalculatorPage.tsx": "Simple page that renders the Calculator component in a centered container.",
  "frontend/src/pages/ChatRoomPage.tsx": "Page that renders the ChatRoom component wrapped in a SubscriptionGuard to require active subscription.",
  "frontend/src/pages/DiscordToolsPage.tsx": "Page that renders the DiscordServerBuilder component wrapped in a SubscriptionGuard for subscription-protected access.",
  "frontend/src/pages/DonationManagerPage.tsx": "Page that renders the DonationManager component wrapped in a SubscriptionGuard for subscription-protected access.",
  "frontend/src/pages/FinanceTrackerPage.tsx": "Page that renders the FinanceTracker component wrapped in a SubscriptionGuard for subscription-protected access.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with hero banner and feature cards that allows users to login via Internet Identity. Showcases app features like revenue tracking, AI assistant, chat room, and various tools.",
  "frontend/src/pages/RevenueDetailsPage.tsx": "Displays detailed revenue information for a specific Twitch account with charts, total revenue, account status badges, and upgrade options. Includes breadcrumb navigation and subscription guard protection.",
  "frontend/src/pages/SubscriptionCancelledPage.tsx": "Page shown when a subscription payment is cancelled, offering options to return to dashboard or retry subscription purchase.",
  "frontend/src/pages/SubscriptionManagementPage.tsx": "Page for managing subscription details, displaying ProfileCard and SubscriptionStatusCard with information about accessing Stripe Customer Portal.",
  "frontend/src/pages/SubscriptionPlansPage.tsx": "Displays available subscription plans (monthly and annual) with pricing, features, and subscribe buttons that redirect to Stripe checkout.",
  "frontend/src/pages/SubscriptionSuccessPage.tsx": "Displays a success confirmation page after subscription activation, invalidates subscription queries, and provides a button to navigate to the dashboard with a list of premium features.",
  "frontend/src/pages/TasksPage.tsx": "Empty file with no content.",
  "frontend/src/pages/TwitchAccountsPage.tsx": "Main dashboard page for managing Twitch affiliate/partner accounts and revenue entries, featuring a hero banner, subscription status card, stats overview, and tabbed interface with forms for adding accounts and revenue.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme with CSS variables, border radius, Inter font family, accordion animations, and plugins for animations and typography.",
  "project_state.json": "Project metadata and state tracking document defining architectural notes (RBAC, subscription checks, purple/pink branding), existing features for Discord/Twitch automation, finance tracking, and UI requirements."
}