{
  "backend/main.mo": "Main backend actor implementing user profile management with owner status, subscription handling, Stripe integration, and access control; includes admin-only functions to set owner status and query methods to check if a user is an owner.",
  "backend/migration.mo": "Data migration module that transforms old user profiles to new profiles by adding an isOwner field (defaulting to false) during actor upgrades.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: admin dashboard page, owner profile badge display, and conditional admin navigation link, all with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks, pages, and components for Twitch account management, subscription handling, and admin dashboard functionality.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark themes with warm earth tones.",
  "frontend/index.html": "HTML entry point for the Stream Automation Hub React application with root div and module script reference.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup, authentication guards for all routes (Twitch accounts, revenue, subscriptions, admin dashboard), and profile setup flow with loading states.",
  "frontend/src/components/Layout.tsx": "Application layout with header navigation including conditional Admin link visible only to owner users, authentication controls, theme provider, and toast notifications.",
  "frontend/src/components/ProfileCard.tsx": "Displays the current user's profile information including name, subscription status/tier, and an admin dashboard button for owners. Shows loading skeletons while fetching data.",
  "frontend/src/components/ProfileSetup.tsx": "Onboarding form that prompts new users to enter their name and creates an initial user profile with inactive subscription status.",
  "frontend/src/components/RevenueChart.tsx": "Displays a table of revenue entries sorted by date with descriptions and amounts, plus a total revenue summary. Shows empty state when no entries exist.",
  "frontend/src/components/RevenueEntryForm.tsx": "Form for adding new revenue entries with Twitch account selection, amount input, and description textarea. Validates required fields and disables submission when no accounts exist.",
  "frontend/src/components/SubscriptionGuard.tsx": "Wrapper component that checks subscription status and displays a paywall card with feature list if user is inactive/cancelled, otherwise renders children.",
  "frontend/src/components/SubscriptionStatusCard.tsx": "Displays detailed subscription information including status badge, tier, start/end dates, and prompts inactive users to view subscription plans.",
  "frontend/src/components/TaskCard.tsx": "Empty file with no content.",
  "frontend/src/components/TaskForm.tsx": "Empty file with no content.",
  "frontend/src/components/TaskList.tsx": "Empty file with no content.",
  "frontend/src/components/TaskStatusIndicator.tsx": "Empty file with no content.",
  "frontend/src/components/TwitchAccountCard.tsx": "Card component displaying a Twitch account's username, type (partner/affiliate), approval status, total revenue, and a button to view detailed revenue information.",
  "frontend/src/components/TwitchAccountForm.tsx": "React form component for adding a new Twitch account with username input and account type selection (affiliate/partner) using react-hook-form and custom UI components.",
  "frontend/src/components/TwitchAccountList.tsx": "Displays a grid of Twitch account cards with loading skeletons and an empty state message when no accounts exist.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with Internet Identity authentication, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient with configurable options and delegation identity management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for managing user profiles, Twitch accounts, revenue entries, subscription status, and Stripe checkout sessions with mutations and queries.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes using warm earth tones.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin-only page for managing subscription plans with CRUD operations, including create/edit dialogs, delete confirmations, and active status toggling with owner permission checks.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with hero banner, login card using Internet Identity authentication, and feature highlights for Twitch account management, revenue tracking, and analytics.",
  "frontend/src/pages/RevenueDetailsPage.tsx": "Displays detailed revenue information for a specific Twitch account, including breadcrumb navigation, account details with badges, revenue stats cards, and a revenue chart component wrapped in SubscriptionGuard.",
  "frontend/src/pages/SubscriptionCancelledPage.tsx": "Payment cancellation page showing an error state with options to return to dashboard or retry subscription purchase.",
  "frontend/src/pages/SubscriptionManagementPage.tsx": "Subscription management dashboard displaying ProfileCard, SubscriptionStatusCard, and information about managing billing through Stripe Customer Portal.",
  "frontend/src/pages/SubscriptionPlansPage.tsx": "Displays available subscription plans (monthly and annual) with features, pricing, and handles Stripe checkout session creation for plan purchases.",
  "frontend/src/pages/SubscriptionSuccessPage.tsx": "Success confirmation page after subscription activation that invalidates relevant queries and displays premium features with a button to navigate to dashboard.",
  "frontend/src/pages/TasksPage.tsx": "Empty page component with no implementation.",
  "frontend/src/pages/TwitchAccountsPage.tsx": "Main dashboard page showing hero banner, subscription status, stats overview cards, and tabbed interface for managing Twitch accounts (affiliates/partners) and revenue entries, all wrapped in SubscriptionGuard.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography settings with Inter font, container queries, animations for accordions, and extended theme utilities for the application.",
  "project_state.json": "Project state file documenting an automation app for Discord/Twitch with features including task management UI, Twitch account integration, passive income tracking, subscription management with Stripe, and admin RBAC system."
}