{
  "backend/main.mo": "Main backend actor implementing user profile management with owner detection via Twitch username, subscription tracking, access control integration, and migration support for adding twitchUsername field to UserProfile type.",
  "backend/migration.mo": "Migration module that transforms old UserProfile records (without twitchUsername) to new UserProfile records (with twitchUsername set to null) while preserving all other fields.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: tracking page separation, Stripe Connect OAuth, subscription enforcement, authentication flow fixes, and owner badge display corrections.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including App.tsx with routing, hooks for backend queries, Layout component with navigation, and various page/component implementations for Twitch accounts, revenue tracking, and subscription management.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes, including background, foreground, primary, secondary, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'Stream Automation Hub'.",
  "frontend/src/App.tsx": "React application root with TanStack Router setup defining routes for Twitch accounts, revenue details, subscriptions, admin dashboard, tracking page, and authentication flow with ProfileSetup modal for new users.",
  "frontend/src/components/AIAssistant.tsx": "A chat interface component for an AI assistant that provides guidance on creating games, websites, and apps with simulated responses based on keyword matching.",
  "frontend/src/components/Calculator.tsx": "A functional calculator component with basic arithmetic operations (add, subtract, multiply, divide), decimal support, and backspace functionality.",
  "frontend/src/components/ChatRoom.tsx": "An Inuyasha-themed chat room component with message display, user avatars, and real-time messaging functionality using user profile data from hooks.",
  "frontend/src/components/DiscordServerBuilder.tsx": "A Discord server planning tool that allows users to configure server structure including channels, roles with colors, and provides a setup guide interface.",
  "frontend/src/components/DonationManager.tsx": "A donation management component that tracks connected payment wallets (PayPal, crypto), displays donation history, and shows total lifetime earnings.",
  "frontend/src/components/FinanceTracker.tsx": "A React component that manages income and expense transactions with summary cards showing total income, expenses, and net balance, plus tabs for adding transactions and viewing history.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, authentication controls, and footer; includes conditional rendering of navigation links based on authentication status and owner privileges.",
  "frontend/src/components/ProfileCard.tsx": "Displays user profile information including name, Twitch username, and owner badge; provides navigation to admin dashboard for owners.",
  "frontend/src/components/ProfileSetup.tsx": "A modal dialog for first-time user profile setup, collecting name and optional Twitch username with special handling for owner recognition.",
  "frontend/src/components/RevenueChart.tsx": "Displays revenue entries in a sortable table with date, description, and amount columns, plus a total revenue summary card at the bottom.",
  "frontend/src/components/RevenueEntryForm.tsx": "Form component for adding new revenue entries with Twitch account selection, amount input, and description fields using react-hook-form validation.",
  "frontend/src/components/SubscriptionGuard.tsx": "A guard component that restricts access to premium features, displaying a subscription prompt for non-owners without active subscriptions.",
  "frontend/src/components/SubscriptionStatusCard.tsx": "Displays the user's subscription status (active, cancelled, or inactive) with relevant details like plan tier, dates, and action buttons to view plans or resubscribe.",
  "frontend/src/components/TaskCard.tsx": "Empty file with no content.",
  "frontend/src/components/TaskForm.tsx": "Empty file with no content.",
  "frontend/src/components/TaskList.tsx": "Empty file with no content.",
  "frontend/src/components/TaskStatusIndicator.tsx": "Empty file with no content.",
  "frontend/src/components/TwitchAccountCard.tsx": "Displays a Twitch account card showing username, account type (affiliate/partner), status badge, total revenue, and action buttons for viewing revenue details or upgrading account type based on subscription status.",
  "frontend/src/components/TwitchAccountForm.tsx": "Form component for creating a new Twitch account with username input and radio button selection for account type (affiliate or partner).",
  "frontend/src/components/TwitchAccountList.tsx": "Renders a grid of TwitchAccountCard components, displays loading skeletons during fetch, and shows an empty state message when no accounts exist.",
  "frontend/src/components/TwitchSubscribeWidget.tsx": "Button widget that opens a Twitch channel (auroramoonveil) in a new window for subscribing.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, Twitch accounts, revenue entries, subscription plans, and related data via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI components and charts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin-only page for managing subscription plans with CRUD operations, restricted to the app owner (CelestiNix).",
  "frontend/src/pages/AIAssistantPage.tsx": "Page component that wraps the AIAssistant component with SubscriptionGuard to require active subscription.",
  "frontend/src/pages/CalculatorPage.tsx": "Simple page component that renders the Calculator component in a centered container.",
  "frontend/src/pages/ChatRoomPage.tsx": "Page component that wraps the ChatRoom component with SubscriptionGuard to require active subscription.",
  "frontend/src/pages/DiscordToolsPage.tsx": "Page component that wraps the DiscordServerBuilder component with SubscriptionGuard to require active subscription.",
  "frontend/src/pages/DonationManagerPage.tsx": "Page component that wraps the DonationManager component with SubscriptionGuard to require active subscription.",
  "frontend/src/pages/FinanceTrackerPage.tsx": "Page component that wraps the FinanceTracker component with SubscriptionGuard to require active subscription.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with hero banner and feature cards that prompts users to login with Internet Identity, showcasing app features like revenue tracking, AI assistant, and chat room.",
  "frontend/src/pages/RevenueDetailsPage.tsx": "Displays detailed revenue information for a specific Twitch account with charts, upgrade options, and breadcrumb navigation, wrapped in SubscriptionGuard.",
  "frontend/src/pages/SubscriptionCancelledPage.tsx": "Error page displayed when a subscription payment is cancelled, offering options to return to dashboard or retry payment.",
  "frontend/src/pages/SubscriptionManagementPage.tsx": "Displays subscription management UI with ProfileCard, SubscriptionStatusCard, and informational card about accessing the Stripe Customer Portal for billing management.",
  "frontend/src/pages/SubscriptionPlansPage.tsx": "Renders subscription plan selection page showing monthly and annual plans with pricing, features, and subscribe buttons that redirect to Stripe checkout.",
  "frontend/src/pages/SubscriptionSuccessPage.tsx": "Success page shown after subscription activation; invalidates subscription queries and displays confirmation with navigation to dashboard.",
  "frontend/src/pages/TasksPage.tsx": "Empty file with no content.",
  "frontend/src/pages/TrackingPage.tsx": "Revenue tracking dashboard with subscription guard showing total/monthly revenue stats, active accounts, and tabbed interface for revenue tracking, finance, and donations.",
  "frontend/src/pages/TwitchAccountsPage.tsx": "Main Twitch accounts management page with hero banner, subscription status, stats cards for accounts/affiliates/partners/revenue, and tabbed interface for account management and revenue entry forms.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using CSS variables, extended theme with chart colors, custom animations, and plugins for animate and typography.",
  "project_state.json": "Project state file tracking a Discord/Twitch automation and community app with AI assistance, finance tracking, and social features. Documents architectural notes, known issues (owner badge, admin login, tracking page separation), and 18 existing features including subscription management, Twitch integration, and UI components."
}