{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Stripe Connect login for owner with light blue menu styling",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Add owner-only Stripe Connect login button in header navigation",
      "acceptanceCriteria": [
        "Stripe Connect login button appears in the header navigation",
        "Button is only visible when the authenticated user is the owner",
        "Clicking the button initiates Stripe Connect OAuth flow for linking bank account",
        "Owner can manage subscription payouts through the Stripe dashboard after connecting"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add Stripe Connect login button to the header navigation bar. The button should be conditionally rendered based on isOwner status from the user profile. Use the useGetCallerUserProfile hook to check if userProfile?.isOwner is true. Position the button in the header next to existing navigation items. The button should trigger the Stripe Connect OAuth flow when clicked, opening a new window to Stripe's OAuth URL with appropriate parameters for account linking. Include proper styling to match the existing header design and ensure the button is clearly labeled for bank account connection purposes."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new custom hook useInitiateStripeConnect that handles the Stripe Connect OAuth flow initiation. This hook should construct the Stripe Connect OAuth URL with the necessary parameters (client_id from environment variables, redirect_uri pointing back to the app, and scope for account access). The hook should return a function that opens the Stripe OAuth URL in a new window when called. Handle any errors during URL construction and provide appropriate error messages via toast notifications."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Update menu background color from white to light blue",
      "acceptanceCriteria": [
        "Header navigation bar background is light blue instead of white",
        "Color change is consistent across all pages",
        "Light blue tone complements the existing purple and pink color scheme",
        "Text and icons remain clearly visible on the light blue background"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a new CSS custom property for light blue menu background in the :root section. Define the color using OKLCH format to match the existing color system (e.g., --menu-bg: oklch(0.90 0.05 220)). Ensure the light blue tone is light enough for good contrast with text and complements the existing purple (hsl(262.1 83.3% 57.8%)) and pink color scheme."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update the header navigation bar className to use the new light blue background color. Replace any existing white or transparent background classes with the new menu background color. Ensure text color and icon colors provide sufficient contrast on the light blue background. Test that the updated styling works correctly in both light and dark modes if theme switching is supported."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Add a new color token to the theme.extend.colors section for the light blue menu background (e.g., 'menu-bg': 'var(--menu-bg)'). This makes the color available as a Tailwind utility class (bg-menu-bg) for use throughout the application."
        }
      ]
    }
  ]
}